read_liberty -lib ../tutorial_tech.lib
read_verilog ../rtl/sphere_32.v
read_verilog ../rtl/vdc_32.v
read_verilog ../rtl/circle_3_32.v
read_verilog ../rtl/vdc_3_ilds_32.v
read_verilog ../rtl/cordic_32.v
read_verilog ../rtl/cordic_sqrt_32.v
hierarchy -top sphere_32
synth -top sphere_32
dfflibmap -liberty ../tutorial_tech.lib
abc -liberty ../tutorial_tech.lib
opt_clean -purge
tee -o sphere_32_timing.rpt stat -liberty ../tutorial_tech.lib
